using DZ7._2;

namespace DZ7
{
    class Program
    {
//Створіть клас Triangle. У тілі класу створіть вкладену структуру TriangleData,
//що містить:
//• три private поля – позначають довжини сторін трикутника;
//• private поля, що позначають периметр трикутника та площу
//трикутника(значення полів має заповнюватися під час ініціалізації полів);
//• одне private поле triangleType типу string – що означає тип
//трикутника(рівносторонній, рівнобедрений, прямокутний, звичайний);
//• властивості доступу до полів, без можливості зміни після ініціалізації;
//• власний конструктор для ініціалізації полів;
//• інший потрібний функціонал.
//У тілі Triangle створіть:
//• публічний статичний метод, що приймає три сторони трикутника та повертає
//структуру TriangleData, із заповненими полями;
//• приватне поле типу TriangleData;
//• власний конструктор для ініціалізації полів, що приймає довжини сторін
//трикутника;
//• інший потрібний функціонал.
//У методі Main продемонструйте роботу всіх зазначених полів та методів.
//Виконайте усі перевірки.
//Площа трикутника обчислюється за формулою Герона:
//Де:
//• p – напівпериметр трикутника;
//• a, b, c – довжини сторін трикутника.
//У методі Main отримаєте структуру TriangleData по сторонах трикутника.
        static void Main(string[] args)
        {
            Triangle tr = new Triangle(4, 7, 9);
            tr.ShowTriangleData();
            Console.ReadKey();
        }
    }
}